{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Reports feature-to-file mappings and metadata for three frontend features with high-confidence evidence.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for major frontend files, components, hooks, and assets.",
  "frontend/index.css": "Tailwind base styles plus custom OKLCH color variables and theme tokens for light/dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/README.md": "Project README describing the three-page Valentine app and image setup instructions.",
  "frontend/src/App.tsx": "Controls page flow between question, celebration, and finale using internal state.",
  "frontend/src/components/FireworksBackground.tsx": "Canvas component that activates the fireworks animation hook.",
  "frontend/src/components/ValentineLayout.tsx": "Layout wrapper with background pattern, gradient overlay, content area, and footer.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing a backend actor based on Internet Identity changes.",
  "frontend/src/hooks/useFireworksAnimation.ts": "Hook animating rising fireworks and particle explosions on a canvas.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, storage, and status management.",
  "frontend/src/hooks/useMovingNoButton.ts": "Empty placeholder hook for former moving‑button behavior.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for React Query hooks.",
  "frontend/src/index.css": "Defines Tailwind base layers and extensive CSS variables for a Valentine-themed color palette, including light/dark modes and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, then renders the main App component.",
  "frontend/src/pages/CelebrationPage.tsx": "Displays a short celebratory screen with bouncing text and heart images, auto-advancing after 5 seconds.",
  "frontend/src/pages/FinalePage.tsx": "Shows a final image with a fallback mechanism and a themed layout, ending with a caption.",
  "frontend/src/pages/QuestionPage.tsx": "Renders the Valentine question UI where the 'No' button shrinks with each click and disappears after four presses.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, animations, and extends theme colors using Valentine-related CSS variables.",
  "project_state.json": "Describes project state and requirements focusing on controlling the 'No' button’s shrinking behavior and placement next to the 'Yes' button."
}