{
  "kind": "build_request",
  "title": "Make the “No” button stay next to “Yes”, shrink per click, and disappear after 4 presses",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Question page so the “No” button is positioned next to the “Yes” button (in the same flex row/column flow) instead of being absolutely positioned and orbiting/moving around it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep the “no” button next to the “yes” button"
        ]
      },
      "acceptanceCriteria": [
        "On the Question page, “No” visually appears adjacent to “Yes” (respecting the existing responsive flex layout).",
        "The “No” button does not use absolute positioning or animated translate-based positioning.",
        "The “No” button does not move/orbit around the “Yes” button over time."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement click tracking for the “No” button on the Question page so that each press makes the “No” button smaller, and after 4 presses the “No” button is no longer visible and cannot be clicked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it should get smaller after each press and after 4 presses non existent."
        ]
      },
      "acceptanceCriteria": [
        "Pressing “No” once reduces its visual size compared to the initial state.",
        "Pressing “No” a second and third time reduces its size further each time.",
        "After the 4th press, the “No” button is not rendered (or is fully hidden and non-interactive) and cannot receive pointer/keyboard events.",
        "“Yes” button behavior remains unchanged and continues to call the provided onYesClick handler."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove (or stop using) the moving/orbiting “No” button behavior for the Question page so it no longer relies on the useMovingNoButton hook for layout/interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep the “no” button next to the “yes” button"
        ]
      },
      "acceptanceCriteria": [
        "QuestionPage.tsx no longer uses translate(x,y) positioning from useMovingNoButton for the “No” button.",
        "No continuous requestAnimationFrame-driven motion affects the “No” button on the Question page.",
        "The “No” button click handler only performs the shrink/disappear behavior (no orbit angle jump/direction reversal behavior remains in effect on this page)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose them only).",
    "Do not modify any files listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add new pages or change the overall multi-page flow (Question -> Celebration -> Finale).",
    "Do not introduce backend persistence for the “No” press count; it can remain frontend-only state.",
    "Do not add new animations unrelated to the “No” button shrink/disappear behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}