{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Keep “No” next to “Yes”, shrink on clicks, and hide after 4 presses",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Place the “No” button adjacent to the “Yes” button within the existing responsive flex layout (no absolute/orbit positioning).",
      "acceptanceCriteria": [
        "On the Question page, “No” visually appears adjacent to “Yes” (respecting the existing responsive flex layout).",
        "The “No” button does not use absolute positioning or animated translate-based positioning.",
        "The “No” button does not move/orbit around the “Yes” button over time."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QuestionPage.tsx",
          "operation": "modify",
          "description": "Update the Question page button layout so “Yes” and “No” render next to each other in the existing flex row/column flow; remove the absolute positioning styles and any translate-based positioning on the “No” button. Continue composing the existing shadcn-ui Button component for both actions (do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Track “No” presses in local state so it shrinks on each click and disappears after 4 presses while keeping “Yes” behavior unchanged.",
      "acceptanceCriteria": [
        "Pressing “No” once reduces its visual size compared to the initial state.",
        "Pressing “No” a second and third time reduces its size further each time.",
        "After the 4th press, the “No” button is not rendered (or is fully hidden and non-interactive) and cannot receive pointer/keyboard events.",
        "“Yes” button behavior remains unchanged and continues to call the provided onYesClick handler."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QuestionPage.tsx",
          "operation": "modify",
          "description": "Add frontend-only click tracking state for the “No” button. On each click, increment the counter and apply a progressively smaller scale (e.g., via transform: scale or Tailwind scale utilities) for presses 1–3; after press 4, stop rendering the “No” button (or make it fully hidden and non-interactive) so it cannot be clicked/focused. Ensure the “Yes” button remains unchanged and still calls onYesClick. Continue composing the existing shadcn-ui Button component; do not modify files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Stop using the moving/orbiting “No” button hook/behavior on the Question page.",
      "acceptanceCriteria": [
        "QuestionPage.tsx no longer uses translate(x,y) positioning from useMovingNoButton for the “No” button.",
        "No continuous requestAnimationFrame-driven motion affects the “No” button on the Question page.",
        "The “No” button click handler only performs the shrink/disappear behavior (no orbit angle jump/direction reversal behavior remains in effect on this page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QuestionPage.tsx",
          "operation": "modify",
          "description": "Remove the useMovingNoButton import/usage, related refs, and any requestAnimationFrame-driven motion coupling from the Question page. Ensure the “No” click handler only performs the shrink/disappear behavior and does not modify orbit angles/speeds or motion-related state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useMovingNoButton.ts",
          "operation": "delete",
          "description": "Delete the unused moving/orbiting “No” button hook if it is no longer referenced anywhere in the frontend, ensuring no imports remain and the Question page no longer relies on it."
        }
      ]
    }
  ]
}